app/views/cart/show.html.erb

SELECT  1 AS one FROM `products` INNER JOIN `line_items` ON `products`.`id` = `line_items`.`product_id` WHERE `line_items`.`order_id` = 2 LIMIT 1
---
  <div class="col-sm-12">
    <% if current_order.products.empty? %>