app/controllers/products_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."product_id" IN (3)
---
  def show
    @product = Product.includes(:reviews).find(params[:id])